#   Вычислить число pi c заданной точностью d
#   Пример:
#   - при $d = 0.001, π = 3.141.

n = int(input('Введите точность: '))
pi = 0
for a in range(n):
    pi += (1 / 16 ** a) * (4 / (8 * a + 1) - 2 /
                           (8 * a + 4) - 1 / (8 * a + 5) - 1 / (8 * a + 6))
print('Число ПИ: ', round(pi, n))
